ErpTest/src/InformationRegisters/пкДополнительнаяИнформацияТехника/пкДополнительнаяИнформацияТехника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пкДополнительнаяИнформацияТехника</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ДопИнформацияПоТехнике</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>БлокGSM</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Заблокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ЗаказНаряд</name>
    <type>
      <types>DocumentRef.пкЗаказНаряд</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаБлокировки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРазблокировки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Техника</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/пкДополнительнаяИнформацияТехника/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ТехникаПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	пкДополнительнаяИнформацияТехникаСрезПоследних.ДопИнформацияПоТехнике КАК ДопИнформацияПоТехнике,
		|	пкДополнительнаяИнформацияТехникаСрезПоследних.БлокGSM КАК БлокGSM,
		|	пкДополнительнаяИнформацияТехникаСрезПоследних.Заблокирован КАК Заблокирован,
		|	пкДополнительнаяИнформацияТехникаСрезПоследних.ЗаказНаряд КАК ЗаказНаряд,
		|	пкДополнительнаяИнформацияТехникаСрезПоследних.ДатаБлокировки КАК ДатаБлокировки,
		|	пкДополнительнаяИнформацияТехникаСрезПоследних.ДатаРазблокировки КАК ДатаРазблокировки
		|ИЗ
		|	РегистрСведений.пкДополнительнаяИнформацияТехника.СрезПоследних(, Техника = &Техника) КАК пкДополнительнаяИнформацияТехникаСрезПоследних";
	
	Запрос.УстановитьПараметр("Техника", Запись.Техника);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 ЗаполнитьЗначенияСвойств(Запись,ВыборкаДетальныеЗаписи,,);
		 Если ВыборкаДетальныеЗаписи.ДатаБлокировки <> Неопределено И ВыборкаДетальныеЗаписи.Заблокирован Тогда
		 
		 	ДатаБлокировкиСтарая = ВыборкаДетальныеЗаписи.ДатаБлокировки;	
		 
		 КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ТехникаПриИзменении(Элемент)
	ТехникаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтаФорма.Параметры.Ключ.Пустой() Тогда
		Запись.Период 					= ТекущаяДата();
		Запись.ДопИнформацияПоТехнике  	= "";
		Запись.БлокGSM 					= Ложь;	
		Запись.Заблокирован 			= Ложь;
		Запись.ЗаказНаряд 				= Неопределено;
		Запись.ДатаБлокировки 			= Неопределено;
		Запись.ДатаРазблокировки 		= Неопределено;
		ТехникаПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры
